# Задаём универсум и пустое множество:
M = set(range(1, 11))     # нат. числа от 1 до 10 включительно
E = set()

# Задаём подмножества M через характеристическое свойство:
A = {x for x in M if x % 2 == 0}  # элементы M, делящиеся на 2
B = {x for x in M if x % 3 == 0}  # элементы M, делящиеся на 3

# Базовые операции над множествами:
print("A ∩ B =", sorted(A & B))          # «\cmo{1}»
print("A ∪ B =", sorted(A | B))          # «\cmo{2}»
print("A \\ B =", sorted(A - B))         # «\cmo{3}»
print("C_M A =", sorted(M - A))          # «\cmo{4}»

# Проверка отношений включения и равенства:
print("A ⊂ M :", A <= M)                 # «\cmo{5}»
print("A = B :", A == B)                 # «\cmo{6}»

# Свойства пустого множества:
print(A & E == E)                        # «\cmo{7}»
print(A | E == A)                        # «\cmo{8}»

# Правила де Моргана:
print(M - (A | B) == (M - A) & (M - B))  # «\cmo{9}»
print(M - (A & B) == (M - A) | (M - B))  # «\cmo{10}»